cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "dart-lang/dart"

brew "curl"
brew "git"
brew "ghq"
brew "hub"
brew "gh"
brew "jq"
brew "openssl"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "zplug"
brew "zsh"
brew "fish"
brew "fzf"
brew "nvim"
brew "graphviz"
brew "plantuml"
brew "anyenv"
brew "peco"
brew "reattach-to-user-namespace"
brew "dart"
cask "alfred"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "clipy"
cask "shiftit"
cask "skype"
cask "visual-studio-code"
cask "google-cloud-sdk"
cask "notion"
cask "discord"
cask "sequel-pro"
cask "deepl"
cask "font-ricty-diminished"
cask "font-noto-sans-cjk-jp"
cask "font-source-code-pro-for-powerline"
mas "Slack", id: 803453959
mas "Magnet", id: 441258766
