cask_args appdir: "/Applications"

# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'wez/wezterm'

brew "fontforge"
brew "jq"
brew "openssl"
brew "terminal-notifier"
brew "graphviz"
brew "plantuml"
brew "mycli"

brew 'go'
brew 'rust'
brew 'deno'

brew "anyenv"
brew 'goenv'
brew "peco"
brew "asdf"

brew 'terraform'
brew "terraformer"
brew "terraforming"
brew "tfenv"
brew "tflint"

brew 'kubectl'
brew 'minikube'

brew 'awscli'

cask "alfred"
# refs: https://zenn.dev/yum3/articles/i_raycast_or_alfred
cask "raycast"
cask "firefox"
# cask "google-chrome"
cask "google-japanese-ime"

cask "intellij-idea"
cask 'phpstorm'
cask "iterm2"
cask "warp"
#cask "hyper"
cask "wez/wezterm/wezterm"
cask "postman"
cask "insomnia"

cask "karabiner-elements"
cask "clipy"
cask "spectacle"
cask "skitch"
cask "gyazo"
cask "appcleaner"
cask "visual-studio-code"
cask "google-cloud-sdk"
cask "notion"
cask "sequel-pro"
cask "deepl"
cask "grammarly"
cask "grammarly-desktop"
cask "font-ricty-diminished"
cask "font-noto-sans-cjk-jp"
cask "font-source-code-pro-for-powerline"
cask "fontforge"
cask 'kindle'
cask 'bartender'
cask 'github'
cask 'jasper'
mas "Magnet", id: 441258766

##
# Editor & shell
##
brew "bash"
brew "tree"
brew "zplug"
brew "zsh"
brew "fish"
brew "fzf"
brew "nvim"
brew "starship"

# Tmux is a newer terminal multiplexer.
brew 'pkg-config', link: true
brew 'tmux'
brew 'reattach-to-user-namespace'

# curl is a command line tool for transferring data with URL syntax.
brew 'curl', link: true

# Wget is a free software package for retrieving files using HTTP and FTP.
brew 'wget'
# ngrok opens a secure tunnel to localhost
cask 'ngrok'

##
# Version control(git
##
brew "git"
brew "ghq"
brew "hub"
brew "gh"

# 1password is a password manager
cask '1password'
cask '1password-cli'

##
# Chat
##

# Discord chat
cask 'discord'

# Slack chat client
# mas "Slack", id: 803453959

##
# GNU command line tools
#
# If you are moving onto macOS from GNU/Linux, then you would probably
# find out that the command line tools shipped with macOS are not as
# powerful and easy to use as the tools in Linux. The reason is that
# macOS uses the BSD version command line tools, which are different
# from the Linux version.
#
# Note: if you choose to replace the macOS commands with GNU commands,
# then be aware that you may have some compatibility issues with shell
# scripts written specifically for macOS.
#
# If you like using man pages, then you may also want to add an
# itemto the to the MANPATH environmental variable:
#
#     $HOMEBREW_PREFIX/opt/coreutils/libexec/gnuman
#
# For more about the GNU command line tools and brew, see this:
# https://www.topbug.net/blog/2013/04/14/install-and-use-gnu-command-line-tools-in-mac-os-x/
##

# Basic file, shell and text manipulation utilities of the GNU operating system.
brew 'coreutils'

brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'gzip'
brew 'watch'
brew 'wdiff'

##
# docker
##
# Compose is a tool for defining and running multi-container Docker applications.
cask 'docker'
brew 'docker-compose'
